tests/n500/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            pressureInletOutletVelocity;
	value		uniform (1.309 0 0);
    }

    MOVINGWALL
    {
        type            fixedValue;
        value           uniform (1.309 0 0);
    }

    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    OUTLET
    {
        type            zeroGradient;
    }

    FRONTANDBACK
    {
        type            empty;
    }
}

// ************************************************************************* //
