tests/n500/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 0;
    }

    MOVINGWALL
    {
        type            zeroGradient;
    }

    WALL
    {
        type            zeroGradient;
    }
    
    OUTLET
    {
        type            zeroGradient;
    }

    FRONTANDBACK
    {
        type            empty;
    }
}

// ************************************************************************* //
