tests/n500/0.org/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
6300
(
(-15971.23105 0.261219711 -3.737827818e-13 0.261219711 0 0 -3.737827818e-13 0 0)
(-15971.12498 0 0 0 0 0 0 0 0)
(-15971.12558 0 0 0 0 0 0 0 0)
(-15971.12559 0 0 0 0 0 0 0 0)
(-15971.12596 0 0 0 0 0 0 0 0)
(-15971.12656 0 0 0 0 0 0 0 0)
(-15971.12656 0 0 0 0 0 0 0 0)
(-15971.12656 0 0 0 0 0 0 0 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<tensor> 
30
(
(-1.818989404e-12 -5.551115123e-17 1.009741959e-28 -5.551115123e-17 0 0 1.009741959e-28 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    FRONTANDBACK
    {
        type            empty;
    }
    WALL
    {
        type            calculated;
        value           nonuniform List<tensor> 
210
(
(-15253.12503 -1654.662504 -1.900139819e-06 -1654.662504 0 0 -1.900139819e-06 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    MOVINGWALL
    {
        type            calculated;
        value           nonuniform List<tensor> 
210
(
(-15971.15143 20006.32473 -4.792229624e-20 20006.32473 0 0 -4.792229624e-20 0 0)
(0 20190.06741 0 20190.06741 0 0 0 0 0)
(0 20377.21344 0 20377.21344 0 0 0 0 0)
(0 20567.86087 0 20567.86087 0 0 0 0 0)
(0 20762.10899 0 20762.10899 0 0 0 0 0)
(0 20960.0619 0 20960.0619 0 0 0 0 0)
(0 21161.82503 0 21161.82503 0 0 0 0 0)
(0 21367.51113 0 21367.51113 0 0 0 0 0)
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<tensor> 
30
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
}


// ************************************************************************* //
