tests/n500/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 493.15;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 465.85;
    }

    MOVINGWALL
    {
        type            fixedValue;
        value           uniform 493.15;
    }

    WALL
    {
        type            fixedValue;
        value           uniform 493.15;
    }
    
    OUTLET
    {
        type            zeroGradient;
    }

    FRONTANDBACK
    {
        type            empty;
    }
}

// ************************************************************************* //
