tests/n500/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    MOVINGWALL
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    WALL
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    FRONTANDBACK
    {
        type            empty;
    }
}


// ************************************************************************* //
