tests/n500/0.org/f
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
    MOVINGWALL
    {
        type            fWallFunction;
        value           uniform 0;
    }
    WALL
    {
        type            fWallFunction;
        value           uniform 0;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    FRONTANDBACK
    {
        type            empty;
    }
}


// ************************************************************************* //
