tests/n500/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 0;
    }

    MOVINGWALL
    {
        type            zeroGradient;
    }

    WALL
    {
        type            zeroGradient;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    FRONTANDBACK
    {
        type            empty;
    }
}

// ************************************************************************* //
