tests/n500/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default         steadyState;
}

gradSchemes
{
	default         Gauss linear;
}

divSchemes
{
	default		Gauss linear UMIST;
	
	div(phi,T)	bounded Gauss upwind; 
	div(phi,U)	bounded Gauss upwind;	
}

laplacianSchemes
{
	default		Gauss linear corrected;
}

interpolationSchemes
{
	default		linear UMIST;
}

snGradSchemes
{
	default		fourth;
}

fluxRequired
{
    	default	no;
    	p;
}


// ************************************************************************* //
