tests/n500/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    	p
    	{
        	solver          GAMG;
        	smoother        GaussSeidel;
        	tolerance       1e-9;
        	relTol          0;
		cacheAgglomeration	true;
		nCellsInCoarsestLevel	20;
		agglomerator    faceAreaPair;
		mergeLevels     1; 
    	}

    	U
    	{
	        solver          smoothSolver;
	        smoother        symGaussSeidel;
 	       	tolerance       1e-06;
 	       	relTol          0.01;
    	}
	
		T
		{
	        	solver          PBiCG;
	        	preconditioner  DILU;
	        	tolerance       1e-8;
	        	relTol          0;
				maxIter			3000;
	    }
}

SIMPLE
{
	nNonOrthogonalCorrectors	1;
	residualControl
    	{
        	p               1e-4;
        	U               1e-4;
        	T				1e-4;
    	}

}

relaxationFactors
{
	p	0.3;
	U	0.7;
	T	0.7;

}


// ************************************************************************* //
